app/views/comments/_comment.html.erb

	</br>
	<strong class="comment_userid"><%= User.find(comment.user_id).name %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]