app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'JcYYK6HnbVJ-DkHqQLDcDg' LIMIT 1
---

<% if cookies.has_key?(:remember_token) and User.find_by_remember_token(cookies[:remember_token]) %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3
---

	<% if @post.comments.all.size > 0 %>