app/controllers/posts_controller.rb

	def create
		@post = Post.new(params[:post])
		@post.date = Date.today.to_s
		@post.user_id = User.find_by_remember_token(cookies[:remember_token]).id

		if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."remember_token" = 'tsJnmk--mty5WfxBsKI8UQ' LIMIT 1
INSERT INTO "posts" ("created_at", "date", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 11 Oct 2013 16:29:39 UTC +00:00], ["date", "2013-10-11"], ["text", "hello world"], ["title", "this is a test"], ["updated_at", Fri, 11 Oct 2013 16:29:39 UTC +00:00]]