app/controllers/sessions_controller.rb

  def create
		user = User.find_by_email(params[:session][:user_email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'foo.com' LIMIT 1