app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
		@comments = Comment.find_all_by_user_id(@user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 1

  def create
    @user = User.new(params[:user])


    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "description", "email", "name", "password", "password_digest", "remember_token", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)